Documents/УДАЛИТЬ_СервисныеЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_СервисныеЗаявки</Name>
			<BasedOn>
				<xr:Item>Document.Лид</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервиснаяБригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УДАЛИТЬ_СервисныеБригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСервисныхЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидКонтрагента</Name>
			<Comment>Вид контрагента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УДАЛИТЬ_СервисныеЗаявки/Ext/ManagerModule.bsl
// СтандартныеПодсистемы.Печать /////////////////////////////////////

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Акт выполненных работ
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.УДАЛИТЬ_СервисныеЗаявки";
    КомандаПечати.Идентификатор = "АктВыполненныхРабот";
    КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктВыполненныхРабот");
    Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "АктВыполненныхРабот",
        НСтр("ru = 'Акт выполненных работ'"),
        ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.УДАЛИТЬ_СервисныеЗаявки.ПФ_MXL_АктВыполненныхРабот");
    КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать ////////////////////////////////

Функция ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати)
    // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктВыполненныхРабот";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УДАЛИТЬ_СервисныеЗаявки.ПФ_MXL_АктВыполненныхРабот");
    // Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	УДАЛИТЬ_СервисныеЗаявки.Ссылка,
    |	УДАЛИТЬ_СервисныеЗаявки.Номер,
	|	УДАЛИТЬ_СервисныеЗаявки.Дата КАК ДатаДокумента,
    |	""текстовая строка"" КАК Дата,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент,
	|	ВЫБОР КОГДА УДАЛИТЬ_СервисныеЗаявки.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидКонтрагента.ЮрЛицо)
	|		ТОГДА
	|			УДАЛИТЬ_СервисныеЗаявки.Контрагент.НаименованиеПолное
	|		ИНАЧЕ
	|			УДАЛИТЬ_СервисныеЗаявки.Контрагент.Наименование
	|		КОНЕЦ КАК ПредставлениеКонтрагента,
    |	УДАЛИТЬ_СервисныеЗаявки.Адрес,
    |	УДАЛИТЬ_СервисныеЗаявки.Содержание,
    |	УДАЛИТЬ_СервисныеЗаявки.Организация,
    |	УДАЛИТЬ_СервисныеЗаявки.Основание,
    |	УДАЛИТЬ_СервисныеЗаявки.Ответственный,
    |	УДАЛИТЬ_СервисныеЗаявки.Комментарий,
    |	УДАЛИТЬ_СервисныеЗаявки.ТекущийСтатус,
	|	УДАЛИТЬ_СервисныеЗаявки.Склад,
	|	УДАЛИТЬ_СервисныеЗаявки.СервиснаяБригада,
	|	УДАЛИТЬ_СервисныеЗаявки.ДатаРабот,
	|	УДАЛИТЬ_СервисныеЗаявки.ВремяНачалаРабот,
	|	УДАЛИТЬ_СервисныеЗаявки.ВремяОкончанияРабот,
    |	УДАЛИТЬ_СервисныеЗаявки.Исполнители.(
    |		Ссылка,
    |		НомерСтроки,
    |		Сотрудник
    |	),
    |	УДАЛИТЬ_СервисныеЗаявки.Материалы.(
    |		Ссылка,
    |		НомерСтроки,
    |		Номенклатура,
    |		ЕдиницаИзмерения,
    |		Количество
    |	),
    |	УДАЛИТЬ_СервисныеЗаявки.Представление,
    |	УДАЛИТЬ_СервисныеЗаявки.МоментВремени,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ФактическийАдрес,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ЮридическийАдрес,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ОсновнойТелефон,
    |	УДАЛИТЬ_СервисныеЗаявки.Контрагент.ОсновнойEMail
    |ИЗ
    |	Документ.УДАЛИТЬ_СервисныеЗаявки КАК УДАЛИТЬ_СервисныеЗаявки
	|ГДЕ
	|	УДАЛИТЬ_СервисныеЗаявки.Ссылка В(&МассивОбъектов)";
	
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//подготовим итоговую таблицу с данными
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
	КонецЦикла;
    
    ПервыйДокумент = Истина;
    Для Каждого Шапка Из РезультатЗапроса Цикл
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСекцияТабличнойЧасти = Ложь;
		ЕстьСекцияТабличнойЧастиИсполнители = Ложь;
		
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти");
			ЕстьСекцияТабличнойЧасти = Истина;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета  = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
			ЕстьСекцияТабличнойЧастиИсполнители = Истина;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		
		Если ЕстьСекцияТабличнойЧасти Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			Для Каждого ВыборкаМатериалов Из Шапка.Материалы Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТабличнойЧасти");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаМатериалов);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		    Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Если ЕстьСекцияТабличнойЧастиИсполнители Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыИсполнители");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
			Для Каждого ВыборкаИсполнители Из Шапка.Исполнители Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаИсполнители);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		    Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицыИсполнители");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
    КонецЦикла;
    Возврат ТабличныйДокумент;
КонецФункции
